app/controllers/recipes_controller.rb

  def index
  @recipes = Recipe.all
---
SELECT * FROM "recipes"

  def show
  @recipe = Recipe.find(params[:id])
---
SELECT * FROM "recipes" WHERE ("recipes"."id" = 1)

  def edit
  @recipe = Recipe.find(params[:id])
---
SELECT * FROM "recipes" WHERE ("recipes"."id" = 1)

  def create
  @recipe = Recipe.create(params[:recipe])
---
INSERT INTO "recipes" ("created_at", "title", "method", "updated_at") VALUES('2011-12-08 15:50:26', 'Cheese Toasty', 'Use Toaster?', '2011-12-08 15:50:26')

  def update
  @recipe = Recipe.find(params[:id])
  @recipe.update_attributes(params[:recipe])
---
SELECT * FROM "recipes" WHERE ("recipes"."id" = 1)
UPDATE "recipes" SET "updated_at" = '2011-12-15 14:30:29', "method" = 'Eat Lots More' WHERE "id" = 1

  def destroy
  @recipe = Recipe.find(params[:id])
  @recipe.delete
---
SELECT * FROM "recipes" WHERE ("recipes"."id" = 4)
DELETE FROM "recipes" WHERE ("id" IN (4))